Edragon/WCH/CH55x/Official SDK/CH559EVT/EVT/EXAM/USB/Host/USBH_HUB_KM.C
* Function Name  : CtrlSetUsbAddress
* Description    : 设置USB设备地址
* Input          : UINT8 addr 设备地址
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
UINT8   CtrlSetUsbAddress( UINT8 addr ) 
{
    UINT8   s;
    CopySetupReqPkg( SetupSetUsbAddr );
    pSetupReq -> wValueL = addr;                                 // USB设备地址
    s = HostCtrlTransfer( NULL, NULL );                          // 执行控制传输
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    SetHostUsbAddr( addr );                                      // 设置USB主机当前操作的USB设备地址
    mDelaymS( 10 );                                              // 等待USB设备完成操作
    return( ERR_SUCCESS );
}
/*******************************************************************************
* Function Name  : CtrlSetUsbConfig
* Description    : 设置USB设备配置
* Input          : UINT8 cfg       配置值
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
UINT8   CtrlSetUsbConfig( UINT8 cfg )                   
{
    CopySetupReqPkg( SetupSetUsbConfig );
    pSetupReq -> wValueL = cfg;                                 // USB设备配置
    return( HostCtrlTransfer( NULL, NULL ) );                   // 执行控制传输
}

/*******************************************************************************
* Function Name  : CtrlSetUsbIntercace
* Description    : 设置USB设备接口
* Input          : UINT8 cfg       配置值
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
UINT8   CtrlSetUsbIntercace( UINT8 cfg )                   
{
    CopySetupReqPkg( SetupSetUsbInterface );
    pSetupReq -> wValueL = cfg;                                 // USB设备配置
    return( HostCtrlTransfer( NULL, NULL ) );                   // 执行控制传输
}

/*******************************************************************************
* Function Name  : CtrlClearEndpStall
* Description    : 清除端点STALL
* Input          : UINT8 endp       端点地址
* Output         : None
* Return         : ERR_SUCCESS      成功
                   其他
*******************************************************************************/
UINT8   CtrlClearEndpStall( UINT8 endp )  
{
    CopySetupReqPkg( SetupClrEndpStall );                       // 清除端点的错误
    pSetupReq -> wIndexL = endp;                                // 端点地址
    return( HostCtrlTransfer( NULL, NULL ) );                   // 执行控制传输
}
/*******************************************************************************
* Function Name  : CtrlGetHIDDeviceReport
* Description    : 获取HID设备报表描述符,返回在TxBuffer中
* Input          : None
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        错误
*******************************************************************************/
UINT8   CtrlGetHIDDeviceReport( void )  
{
    UINT8   s;
    UINT8   len;
    UINT8 tmp[]= {0x21,0x0a,0x00,0x00,0x00,0x00,0x00,0x00};
    for ( s = 0; s != sizeof( tmp ); s ++ )
    {
        ((PUINT8X)pSetupReq)[ s ] = tmp[s];
    }
    s = HostCtrlTransfer( TxBuffer, &len );                     // 执行控制传输
//    if ( s != ERR_SUCCESS )
//    {
//        return( s );
//    }
    CopySetupReqPkg( SetupGetHIDDevReport );
    s = HostCtrlTransfer( TxBuffer, &len );                     // 执行控制传输
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    if ( len < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL )
    {
        return( ERR_USB_BUF_OVER );                             // 描述符长度错误
    }
    return( ERR_SUCCESS );
}
/*******************************************************************************
* Function Name  : CtrlGetHubDescr
* Description    : 获取HUB描述符,返回在TxBuffer中
* Input          : None
* Output         : None
* Return         : ERR_SUCCESS 成功
                   ERR_USB_BUF_OVER 长度错误
*******************************************************************************/
UINT8   CtrlGetHubDescr( void )  
{
    UINT8   s;
    UINT8D  len;
    CopySetupReqPkg( SetupGetHubDescr );
    s = HostCtrlTransfer( TxBuffer, &len );                      // 执行控制传输
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    if ( len < ( (PUSB_SETUP_REQ)SetupGetHubDescr ) -> wLengthL )
    {
        return( ERR_USB_BUF_OVER );                             // 描述符长度错误
    }
//  if ( len < 4 ) return( ERR_USB_BUF_OVER );                  // 描述符长度错误
    return( ERR_SUCCESS );
}
/*******************************************************************************
* Function Name  : HubGetPortStatus
* Description    : 查询HUB端口状态,返回在TxBuffer中
* Input          : UINT8 HubPortIndex 
* Output         : None
* Return         : ERR_SUCCESS 成功
                   ERR_USB_BUF_OVER 长度错误
*******************************************************************************/
UINT8   HubGetPortStatus( UINT8 HubPortIndex )   
{
    UINT8   s;
    UINT8D  len;
    pSetupReq -> bRequestType = HUB_GET_PORT_STATUS;
    pSetupReq -> bRequest = HUB_GET_STATUS;
    pSetupReq -> wValueL = 0x00;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x04;
    pSetupReq -> wLengthH = 0x00;
    s = HostCtrlTransfer( TxBuffer, &len );                     // 执行控制传输
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    if ( len < 4 )
    {
        return( ERR_USB_BUF_OVER );                             // 描述符长度错误
    }
    return( ERR_SUCCESS );
}
/*******************************************************************************
* Function Name  : HubSetPortFeature
* Description    : 设置HUB端口特性
* Input          : UINT8 HubPortIndex                           //HUB端口
                   UINT8 FeatureSelt                            //HUB端口特性
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        错误
*******************************************************************************/
UINT8   HubSetPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt ) 
{
    pSetupReq -> bRequestType = HUB_SET_PORT_FEATURE;
    pSetupReq -> bRequest = HUB_SET_FEATURE;
    pSetupReq -> wValueL = FeatureSelt;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x00;
    pSetupReq -> wLengthH = 0x00;
    return( HostCtrlTransfer( NULL, NULL ) );  // 执行控制传输
}
/*******************************************************************************
* Function Name  : HubClearPortFeature
* Description    : 清除HUB端口特性
* Input          : UINT8 HubPortIndex                           //HUB端口
                   UINT8 FeatureSelt                            //HUB端口特性
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        错误
*******************************************************************************/
UINT8   HubClearPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt ) 
{
    pSetupReq -> bRequestType = HUB_CLEAR_PORT_FEATURE;
    pSetupReq -> bRequest = HUB_CLEAR_FEATURE;
    pSetupReq -> wValueL = FeatureSelt;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x00;
    pSetupReq -> wLengthH = 0x00;
    return( HostCtrlTransfer( NULL, NULL ) );  // 执行控制传输
}
/*******************************************************************************
* Function Name  : AnalyzeHidIntEndp
* Description    : 从描述符中分析出HID中断端点的地址
* Input          : PUINT8X buf       待分析数据缓冲区地址
* Output         : None
* Return         : 中断端点地址
*******************************************************************************/
UINT8   AnalyzeHidIntEndp( PUINT8X buf ) 
{
    UINT8   i, s, l;
    s = 0;
    for ( i = 0; i < ( (PXUSB_CFG_DESCR)buf ) -> wTotalLengthL; i += l )             // 搜索中断端点描述符,跳过配置描述符和接口描述符
    {
        if ( ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bDescriptorType == USB_DESCR_TYP_ENDP  // 是端点描述符
                && ( ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bmAttributes & USB_ENDP_TYPE_MASK ) == USB_ENDP_TYPE_INTER// 是中断端点
                && ( ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bEndpointAddress & USB_ENDP_DIR_MASK ) )// 是IN端点
        {
            s = ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bEndpointAddress & USB_ENDP_ADDR_MASK;// 中断端点的地址
            break;                                                                   // 可以根据需要保存wMaxPacketSize和bInterval
        }
        l = ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bLength;                                // 当前描述符长度,跳过
        if ( l > 16 )
        {
            break;
        }
    }
    return( s );
}
/*******************************************************************************
* Function Name  : InitRootDevice
* Description    : 初始化指定ROOT-HUB端口的USB设备
* Input          : UINT8 RootHubIndex 指定端口，内置HUB端口号0/1
* Output         : None
* Return         :
*******************************************************************************/
UINT8   InitRootDevice( UINT8 RootHubIndex ) 
{
    UINT8   i, s, cfg, dv_cls, if_cls;
    printf( "Reset root hub %1d# port\n", (UINT16)RootHubIndex );
    ResetRootHubPort( RootHubIndex );                              // 检测到设备后,复位相应端口的USB总线
    mDelaymS( 10 );
    for ( i = 0, s = 0; i < 100; i ++ )                            // 等待USB设备复位后重新连接,100mS超时
    {
        mDelaymS( 1 );
        if ( EnableRootHubPort( RootHubIndex ) == ERR_SUCCESS )    // 使能ROOT-HUB端口
        {
            i = 0;
            s ++;                                                  // 计时等待USB设备连接后稳定
            if ( s > 15 )
            {
                break;                                             // 已经稳定连接15mS
            }
        }
    }	
    if ( i )                                                       // 复位后设备没有连接
    {
        DisableRootHubPort( RootHubIndex );
        printf( "Disable root hub %1d# port because of disconnect\n", (UINT16)RootHubIndex );
        return( ERR_USB_DISCON );
    }
    SelectHubPort( RootHubIndex, 0 );
    printf( "GetDevDescr: " );
    s = CtrlGetDeviceDescr( );                                     // 获取设备描述符
    if ( s == ERR_SUCCESS )
    {
        for ( i = 0; i < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL; i ++ )
        {
            printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
        }
        printf( "\n" );                                            // 显示出描述符
        dv_cls = ( (PXUSB_DEV_DESCR)TxBuffer ) -> bDeviceClass;    // 设备类代码
        s = CtrlSetUsbAddress( RootHubIndex + ( (PUSB_SETUP_REQ)SetupSetUsbAddr ) -> wValueL );// 设置USB设备地址,加上RootHubIndex可以保证2个HUB端口分配不同的地址
        if ( s == ERR_SUCCESS )
        {
            RootHubDev[RootHubIndex].DeviceAddress = RootHubIndex + ( (PUSB_SETUP_REQ)SetupSetUsbAddr ) -> wValueL;  // 保存USB地址
            printf( "GetCfgDescr: " );
            s = CtrlGetConfigDescr( );                             // 获取配置描述符
            if ( s == ERR_SUCCESS )
            {
                cfg = ( (PXUSB_CFG_DESCR)TxBuffer ) -> bConfigurationValue;
                for ( i = 0; i < ( (PXUSB_CFG_DESCR)TxBuffer ) -> wTotalLengthL; i ++ )
                {
                    printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
                }
                printf("\n");
                                                                   //分析配置描述符,获取端点数据/各端点地址/各端点大小等,更新变量endp_addr和endp_size等
                if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceClass;  // 接口类代码
                if ( dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE )// 是USB存储类设备,基本上确认是U盘
                {
                    s = CtrlSetUsbConfig( cfg );                   // 设置USB设备配置
                    if ( s == ERR_SUCCESS )
                    {
                        RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                        RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_STORAGE;
                        printf( "USB-Disk Ready\n" );
                        SetUsbSpeed( 1 );                          // 默认为全速
                        return( ERR_SUCCESS );
                    }
                }
                else if ( dv_cls == 0x00 && if_cls == USB_DEV_CLASS_PRINTER && ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceSubClass == 0x01 )// 是打印机类设备
                {
                    printf( "USB-Print OK\n" );
                    RootHubDev[RootHubIndex].GpVar = ( (PUSB_CFG_DESCR_LONG)TxBuffer ) -> endp_descr[0].bEndpointAddress;// 保存批量传输端点
                    s = CtrlSetUsbConfig( cfg );                   // 设置USB设备配置
                    if ( s == ERR_SUCCESS )
                    {
                        s = CtrlSetUsbIntercace(cfg);
                        if(s == ERR_SUCCESS){
                                                                   //需保存端点信息以便主程序进行USB传输
                         RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                         RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_PRINTER;
                         printf( "USB-Print Ready\n" );
                         SetUsbSpeed( 1 );                          // 默认为全速
                         return( ERR_SUCCESS );
                        }
                    }
                }
                else if ( dv_cls == 0x00 && if_cls == USB_DEV_CLASS_HID && ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceSubClass <= 0x01 )// 是HID类设备,键盘/鼠标等
                {
                    s = AnalyzeHidIntEndp( TxBuffer );             // 从描述符中分析出HID中断端点的地址
                    RootHubDev[RootHubIndex].GpVar = s & USB_ENDP_ADDR_MASK ;// 保存中断端点的地址,位7用于同步标志位,清0
                    if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceProtocol;
                    s = CtrlSetUsbConfig( cfg );                   // 设置USB设备配置
                    if ( s == ERR_SUCCESS )
                    {
                        printf( "GetHIDReport: " );
                        s = CtrlGetHIDDeviceReport();              //获取报表描述符
                        if(s == ERR_SUCCESS)
                        {
                            for ( i = 0; i < 64; i++ )
                            {
                                printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
                            }
                            printf("\n");
                        }
                        //Set_Idle( );
                        //需保存端点信息以便主程序进行USB传输
                        RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                        if ( if_cls == 1 )
                        {
                            RootHubDev[RootHubIndex].DeviceType = DEV_TYPE_KEYBOARD;
                            //进一步初始化,例如设备键盘指示灯LED等
                            printf( "USB-Keyboard Ready\n" );
                            SetUsbSpeed( 1 );                      // 默认为全速
                            return( ERR_SUCCESS );
                        }
                        else if ( if_cls == 2 )
                        {
                            RootHubDev[RootHubIndex].DeviceType = DEV_TYPE_MOUSE;
                            //为了以后查询鼠标状态,应该分析描述符,取得中断端口的地址,长度等信息
                            printf( "USB-Mouse Ready\n" );
                            SetUsbSpeed( 1 );                      // 默认为全速
                            return( ERR_SUCCESS );
                        }
                        s = ERR_USB_UNSUPPORT;
                    }
                }
                else if ( dv_cls == USB_DEV_CLASS_HUB )           // 是HUB类设备,集线器等
                {
                    s = AnalyzeHidIntEndp( TxBuffer );            // 从描述符中分析出HID中断端点的地址
                    RootHubDev[RootHubIndex].GpVar1 = s & USB_ENDP_ADDR_MASK ;// 保存中断端点的地址,位7用于同步标志位,清0
                    printf( "GetHubDescr: ");
                    s = CtrlGetHubDescr( );
                    if ( s == ERR_SUCCESS )
                    {
                        for( i = 0; i < TxBuffer[0]; i++ )
                        {
                            printf( "x%02X ",(UINT16)(TxBuffer[i]) );
                        }
                        printf("\n");
                        RootHubDev[RootHubIndex].GpVar = ( (PXUSB_HUB_DESCR)TxBuffer ) -> bNbrPorts;// 保存HUB的端口数量
                        if ( RootHubDev[RootHubIndex].GpVar > HUB_MAX_PORTS )
                        {
                            RootHubDev[RootHubIndex].GpVar = HUB_MAX_PORTS;// 因为定义结构DevOnHubPort时人为假定每个HUB不超过HUB_MAX_PORTS个端口
                        }
                        //if ( ( (PXUSB_HUB_DESCR)TxBuffer ) -> wHubCharacteristics[0] & 0x04 ) printf("带有集线器的复合设备\n");
                        //else printf("单一的集线器产品\n");
                        s = CtrlSetUsbConfig( cfg );               // 设置USB设备配置
                        if ( s == ERR_SUCCESS )
                        {
                            RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                            RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_HUB;
                            //需保存端点信息以便主程序进行USB传输,本来中断端点可用于HUB事件通知,但本程序使用查询状态控制传输代替
                            //给HUB各端口上电,查询各端口状态,初始化有设备连接的HUB端口,初始化设备
                            for ( i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ )// 给HUB各端口都上电
                            {
                                DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_DISCONNECT;  // 清外部HUB端口上设备的状态
                                s = HubSetPortFeature( i, HUB_PORT_POWER );
                                if ( s != ERR_SUCCESS )
                                {
                                    printf( "Ext-HUB Port_%1d# power on error\n",(UINT16)i );// 端口上电失败
                                }
                            }
                            for ( i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ ) // 清除HUB各端口连接状态
                            {
                                s = HubClearPortFeature( i, HUB_C_PORT_CONNECTION );
                                if ( s != ERR_SUCCESS )
                                {
                                    printf( "Ext-HUB Port_%1d#  clear connection error\n",(UINT16)i );// 端口连接状态清除失败
                                }
                            }
														for ( i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ ) // 查询HUB各端口连接状态
														{	
															s = HubGetPortStatus( i );  // 获取端口状态
															if ( s != ERR_SUCCESS ) 
																printf( "Ext-HUB Port_%1d#	clear connection error\n",(UINT16)i );	// 端口连接状态清除失败
															if ( ( TxBuffer[0] != 0 ) && ( DevOnHubPort[RootHubIndex][i-1].DeviceStatus != ROOT_DEV_SUCCESS) ){ //HUB下游端口已有设备连接
															s = HubSetPortFeature( i, HUB_PORT_RESET );  // 对有设备连接的端口复位
															if ( s != ERR_SUCCESS ) 
															return s;  // 可能是该HUB断开了
															do // 查询复位端口,直到复位完成,把完成后的状态显示出来
															{
																mDelaymS( 1 );
																s = HubGetPortStatus( i );
																if ( s != ERR_SUCCESS ) return s;  // 可能是该HUB断开了
															} while ( TxBuffer[0] & (1<<(HUB_PORT_RESET&0x07)) );  // 端口正在复位则等待							
														 }
														}														
                            SetUsbSpeed( 1 );                                        // 默认为全速
                            return( ERR_SUCCESS );
                        }
                    }
                }
                else                                                                 // 可以进一步分析
                {
                    s = CtrlSetUsbConfig( cfg );                                     // 设置USB设备配置
                    if ( s == ERR_SUCCESS ) 
                    {
                        //需保存端点信息以便主程序进行USB传输
                        RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                        RootHubDev[RootHubIndex].DeviceStatus = dv_cls ? dv_cls : if_cls;
                        SetUsbSpeed( 1 );                                            // 默认为全速
                        return( ERR_SUCCESS );                                       // 未知设备初始化成功
                    }
                }
            }
        }
    }
    printf( "InitRootDev Err = %02X\n", (UINT16)s );
    RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_FAILED;
    SetUsbSpeed( 1 );                                                                 // 默认为全速
    return( s );
}
/*******************************************************************************
* Function Name  : EnumAllRootDevice
* Description    : 枚举所有ROOT-HUB端口的USB设备
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
UINT8   EnumAllRootDevice( void )   
{
    UINT8   s, RootHubIndex;
    printf( "EnumAllRootDev\n" );
    for ( RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++ )
    {
        if ( RootHubDev[RootHubIndex].DeviceStatus == ROOT_DEV_CONNECTED )           // 刚插入设备尚未初始化
        {
            s = InitRootDevice( RootHubIndex );                                      // 初始化/枚举指定HUB端口的USB设备
            if ( s != ERR_SUCCESS )
            {
                return( s );
            }
        }
    }
    return( ERR_SUCCESS );
}
/*******************************************************************************
* Function Name  : InitDevOnHub
* Description    : 初始化枚举外部HUB后的二级USB设备
* Input          : UINT8 RootHubIndex  指定ROOT_HUB
                   UINT8 HubPortIndex  指定外部HUB
* Output         : None
* Return         : ERR_SUCCESS 成功
                   ERR_USB_UNKNOWN 未知设备                 
*******************************************************************************/
UINT8   InitDevOnHub( UINT8 RootHubIndex, UINT8 HubPortIndex ) 
{
    UINT8   i, s, cfg, dv_cls, if_cls;
    printf( "Init dev @ExtHub-port_%1d ", (UINT16)HubPortIndex );
    printf( "@Root_%1d\n", (UINT16)RootHubIndex );
    if ( HubPortIndex == 0 )
    {
        return( ERR_USB_UNKNOWN );
    }
    SelectHubPort( RootHubIndex, HubPortIndex );                                      // 选择操作指定的ROOT-HUB端口的外部HUB的指定端口,选择速度
    printf( "GetDevDescr: " );
    s = CtrlGetDeviceDescr( );                                                        // 获取设备描述符
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    dv_cls = ( (PXUSB_DEV_DESCR)TxBuffer ) -> bDeviceClass;                           // 设备类代码
    cfg = ( (RootHubIndex+1)<<4 ) + HubPortIndex;                                     // 计算出一个USB地址,避免地址重叠
    s = CtrlSetUsbAddress( cfg );                                                     // 设置USB设备地址
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceAddress = cfg;                   // 保存分配的USB地址
    printf( "GetCfgDescr: " );
    s = CtrlGetConfigDescr( );                                                        // 获取配置描述符
    if ( s != ERR_SUCCESS )
    {
        return( s );
    }
    cfg = ( (PXUSB_CFG_DESCR)TxBuffer ) -> bConfigurationValue;
    for ( i = 0; i < ( (PXUSB_CFG_DESCR)TxBuffer ) -> wTotalLengthL; i ++ )
    {
        printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
    }
    printf("\n");
    /* 分析配置描述符,获取端点数据/各端点地址/各端点大小等,更新变量endp_addr和endp_size等 */
    if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceClass;         // 接口类代码
    if ( dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE )                          // 是USB存储类设备,基本上确认是U盘
    {
        s = CtrlSetUsbConfig( cfg );                                                  // 设置USB设备配置
        if ( s == ERR_SUCCESS )
        {
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_SUCCESS;
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = USB_DEV_CLASS_STORAGE;
            printf( "USB-Disk Ready\n" );
            SetUsbSpeed( 1 );                                                         // 默认为全速
            return( ERR_SUCCESS );
        }
    }
