Edragon/WCH/CH55x/Official SDK/CH559EVT/EVT/EXAM/USB/Host/USBH_HUB_KM.C
    else if ( dv_cls == 0x00 && if_cls == USB_DEV_CLASS_HID && ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceSubClass <= 0x01 )    // 是HID类设备,键盘/鼠标等
    {
        s = AnalyzeHidIntEndp( TxBuffer );                                            // 从描述符中分析出HID中断端点的地址
        DevOnHubPort[RootHubIndex][HubPortIndex-1].GpVar = s;                         // 保存中断端点的地址,位7用于同步标志位,清0
        if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceProtocol;
        s = CtrlSetUsbConfig( cfg );                                                  // 设置USB设备配置
        if ( s == ERR_SUCCESS )
        {
            //需保存端点信息以便主程序进行USB传输
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_SUCCESS;
            if ( if_cls == 1 )
            {
                DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = DEV_TYPE_KEYBOARD;
                //进一步初始化,例如设备键盘指示灯LED等
                printf( "USB-Keyboard Ready\n" );
                SetUsbSpeed( 1 );                                                     // 默认为全速
                return( ERR_SUCCESS );
            }
            else if ( if_cls == 2 )
            {
                DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = DEV_TYPE_MOUSE;
                                                                                      //为了以后查询鼠标状态,应该分析描述符,取得中断端口的地址,长度等信息
                printf( "USB-Mouse Ready\n" );
                SetUsbSpeed( 1 );                                                     // 默认为全速
                return( ERR_SUCCESS );
            }
            s = ERR_USB_UNSUPPORT;
        }
    }
    else if ( dv_cls == USB_DEV_CLASS_HUB )                                           // 是HUB类设备,集线器等
    {
        DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = USB_DEV_CLASS_HUB;
        printf( "This program don't support Level 2 HUB\n");                         // 需要支持多级HUB级联请参考本程序进行扩展
        s = HubClearPortFeature( i, HUB_PORT_ENABLE );                               // 禁止HUB端口
        if ( s != ERR_SUCCESS )
        {
            return( s );
        }
        s = ERR_USB_UNSUPPORT;
    }
    else                                                                             // 可以进一步分析
    {
        s = CtrlSetUsbConfig( cfg );                                                 // 设置USB设备配置
        if ( s == ERR_SUCCESS )
        {
            //需保存端点信息以便主程序进行USB传输
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_SUCCESS;
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = dv_cls ? dv_cls : if_cls;
            SetUsbSpeed( 1 );                                                        // 默认为全速
            return( ERR_SUCCESS );                                                   //未知设备初始化成功
        }
    }
    printf( "InitDevOnHub Err = %02X\n", (UINT16)s );
    DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_FAILED;
    SetUsbSpeed( 1 );                                                                // 默认为全速
    return( s );
}
/*******************************************************************************
* Function Name  : EnumHubPort
* Description    : 枚举指定ROOT-HUB端口上的外部HUB集线器的各个端口,检查各端口有无连接或移除事件并初始化二级USB设备
* Input          : UINT8 RootHubIndex ROOT_HUB0和ROOT_HUB1
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        失败
*******************************************************************************/
UINT8   EnumHubPort( UINT8 RootHubIndex ) 
{
    UINT8   i, s;
    printf( "EnumHubPort\n" );
    for ( i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ )                          // 查询集线器的端口是否有变化
    {
        SelectHubPort( RootHubIndex, 0 );                                             // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
        s = HubGetPortStatus( i );                                                    // 获取端口状态
        if ( s != ERR_SUCCESS )
        {
            return( s );                                                              // 可能是该HUB断开了
        }
        if ( (( TxBuffer[0]&(1<<(HUB_PORT_CONNECTION&0x07)) ) && ( TxBuffer[2]&(1<<(HUB_C_PORT_CONNECTION&0x07)) ))||(TxBuffer[2] == 0x10) ) 
        {// 发现有设备连接
            DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_CONNECTED;        // 有设备连接
            DevOnHubPort[RootHubIndex][i-1].DeviceAddress = 0x00;
            s = HubGetPortStatus( i );                                                // 获取端口状态
            if ( s != ERR_SUCCESS )
            {
                return( s );                                                          // 可能是该HUB断开了
            }
            DevOnHubPort[RootHubIndex][i-1].DeviceSpeed = TxBuffer[1] & (1<<(HUB_PORT_LOW_SPEED&0x07)) ? 0 : 1;// 低速还是全速
            if ( DevOnHubPort[RootHubIndex][i-1].DeviceSpeed )
            {
                printf( "Found full speed device on port %1d\n", (UINT16)i );
            }
            else
            {
                printf( "Found low speed device on port %1d\n", (UINT16)i );
            }
            mDelaymS( 200 );                                                          // 等待设备上电稳定
            s = HubSetPortFeature( i, HUB_PORT_RESET );                               // 对有设备连接的端口复位
            if ( s != ERR_SUCCESS )
            {
                return( s );                                                          // 可能是该HUB断开了
            }
            printf( "Reset port and then wait in\n" );
            do                                                                        // 查询复位端口,直到复位完成,把完成后的状态显示出来
            {
                mDelaymS( 1 );
                s = HubGetPortStatus( i );
                if ( s != ERR_SUCCESS )
                {
                    return( s );                                                      // 可能是该HUB断开了
                }
            }
            while ( TxBuffer[0] & (1<<(HUB_PORT_RESET&0x07)) );                       // 端口正在复位则等待
            mDelaymS( 100 );
            s = HubClearPortFeature( i, HUB_C_PORT_RESET );                           // 清除复位完成标志
//             s = HubSetPortFeature( i, HUB_PORT_ENABLE );                              // 启用HUB端口
            s = HubClearPortFeature( i, HUB_C_PORT_CONNECTION );                      // 清除连接或移除变化标志
            if ( s != ERR_SUCCESS )
            {
                return( s );
            }
            s = HubGetPortStatus( i );                                                // 再读取状态,复查设备是否还在
            if ( s != ERR_SUCCESS )
            {
                return( s );
            }
            if ( ( TxBuffer[0]&(1<<(HUB_PORT_CONNECTION&0x07)) ) == 0 )
            {
                DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_DISCONNECT;   // 设备不在了
            }
            s = InitDevOnHub( RootHubIndex, i );                                      // 初始化二级USB设备
            if ( s != ERR_SUCCESS )
            {
                return( s );
            }
            SetUsbSpeed( 1 );                                                         // 默认为全速
        }
				else if (TxBuffer[2]&(1<<(HUB_C_PORT_ENABLE&0x07))  )                         // 设备连接出错
				{
						HubClearPortFeature( i, HUB_C_PORT_ENABLE );                              // 清除连接错误标志
					  printf( "Device on port error\n" );		
				  	s = HubSetPortFeature( i, HUB_PORT_RESET );                               // 对有设备连接的端口复位
					  if ( s != ERR_SUCCESS ) 
						return( s );  // 可能是该HUB断开了
					  do // 查询复位端口,直到复位完成,把完成后的状态显示出来
					  {
						  mDelaymS( 1 );
						  s = HubGetPortStatus( i );
						  if ( s != ERR_SUCCESS ) return( s );                                    // 可能是该HUB断开了
					  } while ( TxBuffer[0] & (1<<(HUB_PORT_RESET&0x07)) );                     // 端口正在复位则等待
				}
        else if ( ( TxBuffer[0]&(1<<(HUB_PORT_CONNECTION&0x07)) ) == 0 )              // 设备已经断开
        {
            if ( DevOnHubPort[RootHubIndex][i-1].DeviceStatus >= ROOT_DEV_CONNECTED )
            {
                printf( "Device on port %1d removed\n", (UINT16)i );
            }
            DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_DISCONNECT;       // 有设备连接
            if ( TxBuffer[2]&(1<<(HUB_C_PORT_CONNECTION&0x07)) )
            {
                HubClearPortFeature( i, HUB_C_PORT_CONNECTION );                      // 清除移除变化标志
            }
        }
    }
    return( ERR_SUCCESS );                                                            // 返回操作成功
}
/*******************************************************************************
* Function Name  : EnumAllHubPort
* Description    : 枚举所有ROOT-HUB端口下外部HUB后的二级USB设备
* Input          : None
* Output         : None
* Return         : ERR_SUCCESS 成功
                   其他        失败
*******************************************************************************/
UINT8   EnumAllHubPort( void ) 
{
    UINT8   s, RootHubIndex;
    printf( "EnumAllHubPort\n" );
    for ( RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++ )
    {
        if ( RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS && RootHubDev[RootHubIndex].DeviceType == USB_DEV_CLASS_HUB )// HUB枚举成功
        {
            SelectHubPort( RootHubIndex, 0 );                                         // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
            //做点什么?  给HUB各端口上电,查询各端口状态,初始化有设备连接的HUB端口,初始化设备
//             for ( i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ ){                 // 初始化HUB各端口
//               s = HubSetPortFeature( i, HUB_PORT_POWER );                             // 给HUB各端口上电
//               if ( s != ERR_SUCCESS )
//               {
//                 return( s );                                                          // 可能是该HUB断开了
//               }             							
//             }				
            s = EnumHubPort( RootHubIndex );                                          // 枚举指定ROOT-HUB端口上的外部HUB集线器的各个端口,检查各端口有无连接或移除事件
            if ( s != ERR_SUCCESS )                                                   // 可能是HUB断开了
            {
                printf( "EnumAllHubPort err = %02X\n", (UINT16)s );
            }
            SetUsbSpeed( 1 );                                                         // 默认为全速
        }
    }
    return( ERR_SUCCESS );
}
/*******************************************************************************
* Function Name  : SearchTypeDevice
* Description    : 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号,输出端口号为0xFFFF则未搜索到
* Input          : UINT8 type 搜索的设备类型
* Output         : None
* Return         : 输出高8位为ROOT-HUB端口号,低8位为外部HUB的端口号,低8位为0则设备直接在ROOT-HUB端口上
                   当然也可以根据USB的厂商VID产品PID进行搜索(事先要记录各设备的VID和PID),以及指定搜索序号
*******************************************************************************/
UINT16  SearchTypeDevice( UINT8 type )   
{

