Edragon/WCH/CH55x/Official SDK/CH559EVT/EVT/EXAM/USB/Host/USBH_HUB_KM.C
    UINT8   RootHubIndex, HubPortIndex;
    for ( RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++ )                      // 现时搜索可以避免设备中途拔出而某些信息未及时更新的问题
    {
        if ( RootHubDev[RootHubIndex].DeviceType == type && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS )
        {
            return( (UINT16)RootHubIndex << 8 );                                      // 类型匹配且枚举成功,在ROOT-HUB端口上
        }
        if ( RootHubDev[RootHubIndex].DeviceType == USB_DEV_CLASS_HUB && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS )// 外部集线器HUB且枚举成功
        {
            for ( HubPortIndex = 1; HubPortIndex <= RootHubDev[RootHubIndex].GpVar; HubPortIndex ++ )// 搜索外部HUB的各个端口
            {
                if ( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType == type && DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus >= ROOT_DEV_SUCCESS )
                {
                    return( ( (UINT16)RootHubIndex << 8 ) | HubPortIndex );           // 类型匹配且枚举成功
                }
            }
        }
    }
    return( 0xFFFF );
}
/*******************************************************************************
* Function Name  : mInitSTDIO
* Description    : 为printf和getkey输入输出初始化串口
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void    mInitSTDIO( void )
{
//  SCON = 0x50;
    SM0 = 0;
    SM1 = 1;
    SM2 = 0;
    REN = 1;
    PCON |= SMOD;
    TMOD = TMOD & ~ bT1_GATE & ~ bT1_CT & ~ MASK_T1_MOD | bT1_M1;                    // 0X20
    T2MOD = T2MOD | bTMR_CLK | bT1_CLK;                                              // *12
    TH1 = 0-13;//0xF3;                                                               /* 12MHz晶振, 4800bps*12=57600bps */
    TR1 = 1;
    TI = 1;
}
/*******************************************************************************
* Function Name  : InitUSB_Host
* Description    : 初始化USB主机
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void    InitUSB_Host( void )
{
    UINT8   i;
    IE_USB = 0;
//  LED_CFG = 1;
//  LED_RUN = 0;
    USB_CTRL = bUC_HOST_MODE;                                                       // 先设定模式
    USB_DEV_AD = 0x00;
    UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN ;
    UH_RX_DMA = RxBuffer;
    UH_TX_DMA = TxBuffer;
    UH_RX_CTRL = 0x00;
    UH_TX_CTRL = 0x00;
    USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN;                           // 启动USB主机及DMA,在中断标志未清除前自动暂停
//  UHUB0_CTRL = 0x00;
//  UHUB1_CTRL = 0x00;
    UH_SETUP = bUH_SOF_EN;
    USB_INT_FG = 0xFF;                                                              // 清中断标志
    for ( i = 0; i != 2; i ++ )
    {
        DisableRootHubPort( i );                                                    // 清空
    }
    USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
//  IE_USB = 1;                                                                     // 查询方式
}
/*******************************************************************************
* Function Name  : SETorOFFNumLock
* Description    : NumLock的点灯判断
* Input          : PUINT8 buf 点灯键值
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 SETorOFFNumLock(PUINT8 buf)
{
    UINT8 tmp[]= {0x21,0x09,0x00,0x02,0x00,0x00,0x01,0x00};
    UINT8 len,s;
    if((buf[2]==0x53)&(buf[0]|buf[1]|buf[3]|buf[4]|buf[5]|buf[6]|buf[7]==0))
    {
        for ( s = 0; s != sizeof( tmp ); s ++ )
        {
            ((PUINT8X)pSetupReq)[ s ] = tmp[s];
        }
        s = HostCtrlTransfer( TxBuffer, &len );                                     // 执行控制传输
        if ( s != ERR_SUCCESS )
        {
            return( s );
        }
    }
    return( ERR_SUCCESS );
}

main( )
{
    UINT8   i, s, len, endp;
    UINT16  loc;
    mInitSTDIO( );                                                                  //为了让计算机通过串口监控演示过程
    printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
    InitUSB_Host( );
    FoundNewDev = 0;
    printf( "Wait Device In\n" );
    while ( 1 )
    {
        s = ERR_SUCCESS;
        if ( UIF_DETECT )                                                           // 如果有USB主机检测中断则处理
        {
            UIF_DETECT = 0;                                                         // 清中断标志
            s = AnalyzeRootHub( );                                                  // 分析ROOT-HUB状态
            if ( s == ERR_USB_CONNECT )
            {
                FoundNewDev = 1;
            }
        }
        if ( FoundNewDev || s == ERR_USB_CONNECT )                                  // 有新的USB设备插入
        {
            FoundNewDev = 0;
            mDelaymS( 200 );                                                        // 由于USB设备刚插入尚未稳定,故等待USB设备数百毫秒,消除插拔抖动
            s = EnumAllRootDevice( );                                               // 枚举所有ROOT-HUB端口的USB设备
            if ( s != ERR_SUCCESS )
            {
                printf( "EnumAllRootDev err = %02X\n", (UINT16)s );
            }
        }
        //other work for each device
        mDelaymS( 100 );                                                            // 模拟单片机做其它事
        if ( RI == 0 )
        {
            continue;
        }
        i = getkey( );
        printf( "%c", (UINT8)i );
        if ( i == 'E')                                                             // 每隔一段时间,通常是100mS到1000mS,对外部HUB的端口进行一下枚举,单片机有空时做
        {
            s = EnumAllHubPort( );                                                  // 枚举所有ROOT-HUB端口下外部HUB后的二级USB设备
            if ( s != ERR_SUCCESS )                                                 // 可能是HUB断开了
            {
                printf( "EnumAllHubPort err = %02X\n", (UINT16)s );
            }
        }

        switch( i )                                                                 // 模拟主观请求,对某USB设备进行操作
        {
        case 'M':                                                                   // 用定时模拟主观需求,需要操作鼠标
            loc = SearchTypeDevice( DEV_TYPE_MOUSE );                               // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号
            if ( loc != 0xFFFF )                                                    // 找到了,如果有两个MOUSE如何处理?
            {
                printf( "Query Mouse @%04X\n", loc );
                i = (UINT8)( loc >> 8 );
                len = (UINT8)loc;
                SelectHubPort( i, len );                                            // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
                //对鼠标进行操作
                //s = GetDeviceDescr( );                                            // 获取设备描述符
                //if ( s == USB_INT_SUCCESS ) {
                //for ( s = 0; s < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL; s ++ ) printf( "x%02X ", (UINT16)( TxBuffer[s] ) );
                //printf( "\n" );                                                   // 显示出描述符
                //}
                endp = len ? DevOnHubPort[i][len-1].GpVar : RootHubDev[i].GpVar;    // 中断端点的地址,位7用于同步标志位
                if ( endp & USB_ENDP_ADDR_MASK )                                    // 端点有效
                {
                    s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );// CH559传输事务,获取数据,NAK不重试
                    if ( s == ERR_SUCCESS )
                    {
                        endp ^= 0x80;                                               // 同步标志翻转
                        if ( len )
                        {
                            DevOnHubPort[i][len-1].GpVar = endp;                    // 保存同步标志位
                        }
                        else
                        {
                            RootHubDev[i].GpVar = endp;
                        }
                        len = USB_RX_LEN;                                           // 接收到的数据长度
                        if ( len )
                        {
                            printf("Mouse data: ");
                            for ( i = 0; i < len; i ++ )
                            {
                                printf("x%02X ",(UINT16)(RxBuffer[i]) );
                            }
                            printf("\n");
                        }
                    }
                    else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) )
                    {
                        printf("Mouse error %02x\n",(UINT16)s);                      // 可能是断开了
                    }
                }
                else
                {
                    printf("Mouse no interrupt endpoint\n");
                }
                SetUsbSpeed( 1 );                                                    // 默认为全速
            }
            break;
        case 'K':                                                                    // 用定时模拟主观需求,需要操作键盘
            loc = SearchTypeDevice( DEV_TYPE_KEYBOARD );                             // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号
            if ( loc != 0xFFFF )                                                     // 找到了,如果有两个KeyBoard如何处理?
            {
                printf( "Query Keyboard @%04X\n", loc );
                i = (UINT8)( loc >> 8 );
                len = (UINT8)loc;
                SelectHubPort( i, len );                                             // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
                //对键盘进行操作
                //s = GetDeviceDescr( );  // 获取设备描述符
                //if ( s == USB_INT_SUCCESS ) {
                //for ( s = 0; s < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL; s ++ ) printf( "x%02X ", (UINT16)( TxBuffer[s] ) );
                //printf( "\n" ); // 显示出描述符
                //}
                endp = len ? DevOnHubPort[i][len-1].GpVar : RootHubDev[i].GpVar;     // 中断端点的地址,位7用于同步标志位
                printf("%02X  ",endp);
                if ( endp & USB_ENDP_ADDR_MASK )                                     // 端点有效
                {
                    s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );// CH559传输事务,获取数据,NAK不重试
                    if ( s == ERR_SUCCESS )
                    {
                        endp ^= 0x80;                                                // 同步标志翻转
                        if ( len )
                        {
                            DevOnHubPort[i][len-1].GpVar = endp;                     // 保存同步标志位
                        }
                        else
                        {
                            RootHubDev[i].GpVar = endp;
                        }
                        len = USB_RX_LEN;                                            // 接收到的数据长度
                        if ( len )
                        {
                            SETorOFFNumLock(RxBuffer);
                            printf("keyboard data: ");
                            for ( i = 0; i < len; i ++ )
                            {
                                printf("x%02X ",(UINT16)(RxBuffer[i]) );
                            }
                            printf("\n");
                        }
                    }
                    else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) )
                    {
                        printf("keyboard error %02x\n",(UINT16)s);                    // 可能是断开了
                    }
                }
                else
                {
                    printf("keyboard no interrupt endpoint\n");
                }
                SetUsbSpeed( 1 );                                                     // 默认为全速
            }
            break;
        case 'H':                                                                     //操作HUB
            loc = SearchTypeDevice( DEV_TYPE_KEYBOARD );                              // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号
            if ( loc != 0xFFFF )                                                      // 找到了,如果有两个KeyBoard如何处理?
            {
                printf( "Query Keyboard @%04X\n", loc );
                i = (UINT8)( loc >> 8 );
                len = (UINT8)loc;
                SelectHubPort( i, len );                                              // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
                //对键盘进行操作
                //s = GetDeviceDescr( );                                              // 获取设备描述符
                //if ( s == USB_INT_SUCCESS ) {
                //for ( s = 0; s < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL; s ++ ) printf( "x%02X ", (UINT16)( TxBuffer[s] ) );
                //printf( "\n" );                                                     // 显示出描述符
                //}
                endp = len ? DevOnHubPort[i][len-1].GpVar : RootHubDev[i].GpVar;      // 中断端点的地址,位7用于同步标志位
                printf("%02X  ",endp);
                if ( endp & USB_ENDP_ADDR_MASK )                                      // 端点有效
                {
                    s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );// CH559传输事务,获取数据,NAK不重试
                    if ( s == ERR_SUCCESS )
                    {
                        endp ^= 0x80;                                                 // 同步标志翻转
                        if ( len )
                        {
                            DevOnHubPort[i][len-1].GpVar = endp;                      // 保存同步标志位
                        }
                        else
                        {
                            RootHubDev[i].GpVar = endp;
                        }
                        len = USB_RX_LEN;                                             // 接收到的数据长度
                        if ( len )
                        {
                            //SETorOFFNumLock(RxBuffer);
                            printf("keyboard data: ");
                            for ( i = 0; i < len; i ++ )
                            {
                                printf("x%02X ",(UINT16)(RxBuffer[i]) );
                            }
                            printf("\n");
                        }
                    }
                    else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) )
                    {
                        printf("keyboard error %02x\n",(UINT16)s);                    // 可能是断开了
                    }
                }
                else
                {
                    printf("keyboard no interrupt endpoint\n");
                }
                SetUsbSpeed( 1 );                                                     // 默认为全速
            }
            for(i=0; i<2; i++)
            {
                if((RootHubDev[i].DeviceStatus == ROOT_DEV_SUCCESS)&&(RootHubDev[i].DeviceType == USB_DEV_CLASS_HUB))
                {
                    SelectHubPort( i, 0 );                                            // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
                    endp = RootHubDev[i].GpVar1;                                      // 中断端点的地址,位7用于同步标志位
                    //printf("111 %02X\n",(UINT16)endp);
                    //printf("*");
                    if ( endp & USB_ENDP_ADDR_MASK )                                  // 端点有效
                    {
                        s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );// CH559传输事务,获取数据,NAK不重试
                        if ( s == ERR_SUCCESS )
                        {
                            endp ^= 0x80;                                             // 同步标志翻转
                            RootHubDev[i].GpVar1 = endp;                              // 保存同步标志位
                            len = USB_RX_LEN;                                         // 接收到的数据长度
                            if ( len )
                            {
                                EnumHubPort(i);
                                for ( i = 0; i < len; i ++ )
                                {
                                    printf("x%02X ",(UINT16)(RxBuffer[i]) );
                                }
                                printf("\n");
                            }
                        }
                        else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) )
                        {
                            printf("HUB error %02x\n",(UINT16)s);                     // 可能是断开了
                        }
                    }
                    else
                    {
                        printf("HUB %02d no interrupt endpoint\n",i);
                    }
                }
                else
                {
                    //printf("ROOTHUB %02d not HUB\n",i);
									  //printf(".");
                }
            }
            break;
        case 'P':                                                                     //操作USB打印机
					  if((P4_IN&0x01) == 0)                                                     //P40为低，开始打印
            {
							memset(TxBuffer,0,sizeof(TxBuffer));
              TxBuffer[0]=0x1B;TxBuffer[1]=0x40;TxBuffer[2]=0x1D;TxBuffer[3]=0x55;TxBuffer[4]=0x42;TxBuffer[5]=0x02;TxBuffer[6]=0x18;TxBuffer[7]=0x1D;
              TxBuffer[8]=0x76;TxBuffer[9]=0x30;TxBuffer[10]=0x00;TxBuffer[11]=0x30;TxBuffer[12]=0x00;TxBuffer[13]=0x18;
							loc = SearchTypeDevice( USB_DEV_CLASS_PRINTER );                          // 在ROOT-HUB以及外部HUB各端口上搜索指定类型的设备所在的端口号
							if ( loc != 0xFFFF )                                                      // 找到了,如果有两个打印机如何处理?
							{
									printf( "Query Printer @%04X\n", loc );
									i = (UINT8)( loc >> 8 );
									len = (UINT8)loc;
									SelectHubPort( i, len );                                              // 选择操作指定的ROOT-HUB端口,设置当前USB速度以及被操作设备的USB地址
									endp = len ? DevOnHubPort[i][len-1].GpVar : RootHubDev[i].GpVar;      // 端点的地址,位7用于同步标志位
									printf("%02X  ",endp);
									if ( endp & USB_ENDP_ADDR_MASK )                                      // 端点有效
									{
                      UH_TX_LEN = 64;                                                   // 默认无数据故状态阶段为IN										
											s = USBHostTransact( USB_PID_OUT << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0xffff );// CH559传输事务,获取数据,NAK重试
											if ( s == ERR_SUCCESS )
											{
													endp ^= 0x80;                                                 // 同步标志翻转
                          memset(TxBuffer,0,sizeof(TxBuffer));
                          UH_TX_LEN = 64;                                                   // 默认无数据故状态阶段为IN										
											    s = USBHostTransact( USB_PID_OUT << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0xffff );// CH559传输事务,获取数据,NAK重试   											
											}
											else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) )
											{
													printf("Printer error %02x\n",(UINT16)s);                    // 可能是断开了
											}
									}
									SetUsbSpeed( 1 );                                                     // 默认为全速
							}				
            }
            break;
        default:
            break;
        }
    }
}
